app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO `movies` (`name`, `picture`, `description`, `rating`, `created_at`, `updated_at`) VALUES ('The cellular', 'https://upload.wikimedia.org/wikipedia/en/5/5b/X-Men_The_Last_Stand_theatrical_poster.jpg', 'In 1986, Charles Xavier and Erik Lehnsherr meet young Jean Grey at her parents house to invite her to join their school, the X-Mansion.', 1, '2021-09-02 01:43:32.956623', '2021-09-02 01:43:32.956623')

  def update
    if @movie.update(movie_params)
---
UPDATE `movies` SET `movies`.`release_date` = '2020-12-21', `movies`.`updated_at` = '2021-09-02 01:44:53.862982' WHERE `movies`.`id` = 21

  def destroy
    @movie.destroy
---
DELETE FROM `movies` WHERE `movies`.`id` = 21

  def set_movie
    @movie = Movie.find(params[:id])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1